#####
# Tap
#####

# HomeBrew
# brew: install libraries that are registered in Homebrew.
tap 'homebrew/core'

# HomeBrew cask
# cask: install Mac application that are usually installed via .dmg file (ex. Google Chrome).
tap 'homebrew/cask'
tap 'homebrew/cask-versions'

# HomeBrew tap
# tap: install libraries that are not registered in Homebrew.
tap 'nektos/tap'

# Mas CLI
# mas: install Mac application that are available in the AppStore.
# https://github.com/mas-cli/mas
brew 'mas'

# Flutter / Dart
# https://dart.dev/get-dart
tap 'dart-lang/dart'
# fvm
# https://fvm.app/docs/getting_started/installation
tap 'leoafarias/fvm'

# Heroku CLI
tap 'heroku/brew'

#####
# Brew
#####

# GitHub Action on Local
# https://github.com/nektos/act
brew 'act'

# Anyenv
# TODO: script that uses anyenv to install `pyenv`, `rbenv`, `tfenv`
# https://github.com/anyenv/anyenv
brew 'anyenv'

# AWS EB
# aws-elasticbeanstalk = awsebcli
# https://formulae.brew.sh/formula/aws-elasticbeanstalk
# https://docs.aws.amazon.com/elasticbeanstalk/latest/dg/eb-cli3-install-osx.html
brew 'aws-elasticbeanstalk'

# dirnev
# https://github.com/direnv/direnv
brew 'direnv'

# fvm
# https://github.com/leoafarias/fvm
brew 'fvm'

# fzy
# used together with enchancd
# https://github.com/jhawthorn/fzy
brew 'fzy'

# GNU GCC
# https://formulae.brew.sh/formula/gcc
brew 'gcc'

# GitHub CLI
# https://cli.github.com/
brew 'gh'

# GHQ
# https://github.com/x-motemen/ghq
brew 'ghq'

# Git
# https://formulae.brew.sh/formula/git
brew 'git'

# grep
# https://formulae.brew.sh/formula/grep
brew 'grep'

# Verilog-HDL
# https://github.com/steveicarus/iverilog
# https://formulae.brew.sh/formula/icarus-verilog
brew 'icarus-verilog'

# Imagemagick
# Tools and libraries to manipulate images in many formats
# https://imagemagick.org/script/download.php
brew 'imagemagick'
# Imagemagick requires ghostscript
brew 'ghostscript'

# MySQL
# https://formulae.brew.sh/formula/mysql
brew 'mysql'

# nmap
# Port scanning utility for large networks
# https://formulae.brew.sh/formula/nmap
brew 'nmap'

# Redis
# https://formulae.brew.sh/formula/redis
brew 'redis'

# Terraform
# Infrastructure as Code
# https://formulae.brew.sh/formula/terraform
brew 'terraform'

# Terraformer
# CLI tool to generate terraform files from existing infrastructure
# https://formulae.brew.sh/formula/terraformer
brew 'terraformer'

# tree
# Display directories as trees (with optional color/HTML output)
# https://formulae.brew.sh/formula/tree
brew 'tree'

# Webp
# a new image format optimized for web browser
# https://formulae.brew.sh/formula/webp
brew 'webp'

#####
# Cask
#####

# TODO: need to add more cask
# VSCode, iTerm

# Anki
cask 'anki'

# Latex
# https://qiita.com/rainbartown/items/d7718f12d71e688f3573
cask 'mactex-no-gui'

# Sequel Ace
# MySQL/MariaDB database management for macOS
# https://github.com/Sequel-Ace/Sequel-Ace
cask 'sequel-ace'

# XQuartz
# X11-Forwarding through ssh
cask 'xquartz'

#####
# mas
#####

# TODO: need to install apps from AppStore using mas
