#####
# Tap
#####

# HomeBrew
# brew: install libraries that are registered in Homebrew.
tap 'homebrew/core'

# HomeBrew cask
# cask: install Mac application that are usually installed via .dmg file (ex. Google Chrome).
tap 'homebrew/cask'
tap 'homebrew/cask-versions'

# Mas CLI
# mas: install Mac application that are available in the AppStore.
# https://github.com/mas-cli/mas
brew 'mas'

#####
# Brew
#####

# delta
# A syntax-highlighting pager for git, diff, and grep output
# https://github.com/dandavison/delta
brew 'git-delta'

# fzy
# used together with enchancd
# https://github.com/jhawthorn/fzy
brew 'fzy'

# GNU GCC
# https://formulae.brew.sh/formula/gcc
brew 'gcc'

# GitHub CLI
# https://cli.github.com/
brew 'gh'

# GHQ
# https://github.com/x-motemen/ghq
brew 'ghq'

# Git
# https://formulae.brew.sh/formula/git
brew 'git'

# grep
# https://formulae.brew.sh/formula/grep
brew 'grep'

# nmap
# Port scanning utility for large networks
# https://formulae.brew.sh/formula/nmap
brew 'nmap'

# tree
# Display directories as trees (with optional color/HTML output)
# https://formulae.brew.sh/formula/tree
brew 'tree'

# libusb
# Library for USB device access
brew 'libusb'

# wget
# Internet file retriever
brew 'wget'

# tldr
brew 'tldr'

#####
# Cask
#####

# TODO: need to add more cask
# VSCode, iTerm

# 1Password
# https://1password.com/
cask '1password'

# Alfred
# https://www.alfredapp.com/
cask 'alfred'

# Clipy
# https://github.com/Clipy/Clipy
cask 'clipy'

# Discord
cask 'discord'

# Google Chrome
# https://google.com/chrome
cask 'google-chrome'

# Google Japanese Ime
# https://www.google.co.jp/ime/
cask 'google-japanese-ime'

# Latex
# https://qiita.com/rainbartown/items/d7718f12d71e688f3573
cask 'mactex-no-gui'

# Notion
cask 'notion'

# Obsidian
# https://obsidian.md/
cask 'obsidian'

# Rectangle
# Move and resize windows using keyboard shortcuts or snap areas
# https://github.com/rxhanson/Rectangle
cask 'rectangle'

# Slack
cask 'slack'

# Skitch
# Screenshot & Annotation
# https://evernote.com/products/skitch
cask 'skitch'

# VSCode
# https://code.visualstudio.com/
cask 'visual-studio-code'

#####
# mas
#####

# TODO: need to install apps from AppStore using mas
